In [1]:
# importaciones necesarias para el EDA:
import pandas as pd
import numpy as np

In [15]:
df_flight_activity = pd.read_csv('files/customer_flight_activity.csv')
df_loyalty_histori = pd.read_csv('files/customer_loyalty_history.csv', index_col=0)

In [30]:
# modificar columnas a minus

In [17]:
df_flight_activity.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [9]:
df_flight_activity.shape

(405624, 9)

In [18]:
df_flight_activity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB

In [21]:
df_flight_activity.duplicated().sum()

1864

In [ ]:
df_flight_activity['Loyalty Number'].duplicated().sum() # se supone que es un registro unico

388887

In [31]:
df_flight_activity['Loyalty Number'].value_counts()

Loyalty Number
678205    72
989528    48
373638    48
684889    48
684881    48
          ..
428526    24
428536    24
428565    24
428590    24
999891    24
Name: count, Length: 16737, dtype: int64

In [29]:
df_flight_activity[df_flight_activity.duplicated()].sample(100)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
372049,112142,2018,11,0,0,0,0,0.0,0,0
270905,126490,2018,5,0,0,0,0,0.0,0,0
1420,106509,2017,3,0,0,0,0,0.0,0,0
171036,208241,2017,11,0,0,0,0,0.0,0,0
161224,584782,2017,10,0,0,0,0,0.0,0,0
...,...,...,...,...,...,...,...,...,...,...
102441,156031,2017,7,0,0,0,0,0.0,0,0
352824,886803,2018,9,0,0,0,0,0.0,0,0
249373,776466,2018,3,0,0,0,0,0.0,0,0
249329,773857,2018,3,0,0,0,0,0.0,0,0
96587,741848,2017,6,0,0,0,0,0.0,0,0

In [ ]:
df_flight_activity = df_flight_activity.drop_duplicates() # al ser filas que carecen de valor al repetirse decido eliminarlas del dataframe

In [ ]:
# no hay nulos en el dataframe, la unica fila que es float es puntos acumulados, compruebo si se pueden acumular puntos decimales

In [25]:
df_loyalty_histori.head()

,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,
480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [27]:
df_loyalty_histori.shape

(16737, 15)

In [32]:
df_loyalty_histori.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16737 entries, 480934 to 652627
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Country             16737 non-null  object
 1   Province            16737 non-null  object
 2   City                16737 non-null  object
 3   Postal Code         16737 non-null  object
 4   Gender              16737 non-null  object
 5   Education           16737 non-null  object
 6   Salary              12499 non-null  float64
 7   Marital Status      16737 non-null  object
 8   Loyalty Card        16737 non-null  object
 9   CLV                 16737 non-null  float64
 10  Enrollment Type     16737 non-null  object
 11  Enrollment Year     16737 non-null  int64
 12  Enrollment Month    16737 non-null  int64
 13  Cancellation Year   2067 non-null   float64
 14  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(2), object(9)
memory usage: 2.0+ MB

In [ ]:
# en salary hay nulos y en cancelation year y cancelation month

In [35]:
df_loyalty_histori[df_loyalty_histori[['Country', 'Education', 'Salary']].isna().any(axis=1)] # recojo los datos de pais salario y educacion para tratar los nulos con una media

,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
927943,Canada,Ontario,Toronto,P5S 6R4,Female,College,NaN,Single,Star,3857.95,Standard,2014,6,NaN,NaN
988178,Canada,Quebec,Montreal,H4G 3T4,Male,College,NaN,Single,Star,3871.07,Standard,2013,10,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
632951,Canada,Alberta,Edmonton,T9G 1W3,Female,College,NaN,Married,Star,44771.30,Standard,2018,7,NaN,NaN
546773,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Married,Star,52811.49,Standard,2015,9,NaN,NaN
900501,Canada,Ontario,Sudbury,M5V 1G5,Male,College,NaN,Single,Star,61134.68,Standard,2012,9,NaN,NaN
823768,Canada,British Columbia,Vancouver,V6E 3Z3,Female,College,NaN,Married,Star,61850.19,Standard,2012,12,NaN,NaN
776187,Canada,British Columbia,Vancouver,V5R 1W3,Male,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN

In [ ]:
df_loyalty_histori['Country'].unique()
df_loyalty_histori['Education'].unique() # como pais es el mismo, hare una media de que gana cada educacion y asi rellenare los nan

array(['Bachelor', 'College', 'Master', 'High School or Below', 'Doctor'],
      dtype=object)

In [ ]:
round(df_loyalty_histori.groupby("Education")["Salary"].mean(), 2)
# no hay ningun registro de college

Education
Bachelor                 72451.06
College                       NaN
Doctor                  178608.90
High School or Below     61071.72
Master                  103757.85
Name: Salary, dtype: float64

In [ ]:
df["Salary"] = df["Salary"].fillna(df.groupby("Education")["Salary"].transform("mean"))

In [ ]:
df_completo = df_grande.merge(df2, on="Loyalty Number", how="left")